{
  "bucketlist" : [ {
    "title" : "Travel in all our continents"
  }, {
    "title" : "Do international volunteer"
  }, {
    "title" : "Take a long journey by the sea"
  }, {
    "title" : "Jump from a very (veeery) high point (without dying)"
  }, {
    "title" : "Ice skating on a frozen lake"
  }, {
    "title" : "Surf in all the oceans and some seas"
  }, {
    "title" : "Get a motorcycle licence"
  }, {
    "title" : "Donate my blood (I'm scared of syringes)"
  }, {
    "done" : "true",
    "title" : "Skate in a place where I've never been before"
  } ],
  "codepen-ideas" : [ {
    "title" : "a monkey"
  }, {
    "done" : true,
    "link" : "https://codepen.io/graziastrax/pen/RVyPVd/",
    "title" : "something with a skate"
  }, {
    "done" : true,
    "link" : "https://codepen.io/graziastrax/pen/YVvLdx",
    "title" : "something to celebrate my new ukulele"
  }, {
    "done" : true,
    "link" : "https://codepen.io/graziastrax/pen/WjzZpx",
    "title" : "draw something with html and css"
  }, {
    "title" : "a ride with a bicycle"
  } ],
  "codepen-suggestions" : {
    "title" : "test"
  },
  "posts" : {
    "-KpicL8k6aiPoXxtpy58" : {
      "body" : "<p>For some reasons, it's the morning the moment of the day when I feel more sensitive. It's in the morning that my mind is just a crazy mess, a vortex of random thoughts. I can quickly switch from one to another accumulating a long list of questions, doubts, uncertainties, hopes, wishes, and again questions, doubts... but then, in a moment it's like they suddenly stop over me, and they stare at me, waiting. In a moment everything is simply frozen by a single thought.</p><p>I didn't speak with my father yet, he doesn't know anything, not a single of those thoughts. I don't need his permission, of course, I am supposed to be an adult by now. But. I just want his blessing. I want to be free to share all of my thoughts, all of my future experiences without worrying about a thing. I want to be free knowing my beloved ones wish my best along that journey. Their blessing will be the additional encouragement I will use to move forward when life will be tough.</p><p>So, here I am. My dreams are in standby mode, waiting for me to be explored and realised, and me, just a few days left to go home,&nbsp;free my mind and start planning, talking, dreaming...</p>",
      "creationDate" : 1501542000000,
      "id" : "-KpicL8k6aiPoXxtpy58",
      "isPublic" : false,
      "location" : "Dublin, Ireland",
      "modifyDate" : 1501674989763,
      "title" : "Waiting for day 1"
    },
    "-KqSaZojQdPNkizJ8m5F" : {
      "body" : "<p>Ok, the decision is made. I'm gonna travel the world, soon. I have more or less a deadline. I speak with people, I convince the others that I'm going to do this great long term trip around the planet. Mostly I convince my self about this decision.&nbsp;</p><p>Most of the times when I made a big decision, one that took plenty of effort to be realised, in those cases I just do it. No matter what, I go, I do. There's an old say \"strike while the iron's hot\".&nbsp;</p><p>But this decision is different. The time between that moment and the realisation moment is precious. I need that time in between. I need to plan. I need to read, find inspiration. And I need to save money.</p><p>There are many resources out there that explain how to live on a budget, tip and tricks how to save on living. But because I don't know what to expect, because that will be the very first time somewhere \"there\" completely by my self, I want to be prepared.</p><p>So I started saving money.</p><p>I know that any extra spending will delay my trip, and also, I will collect more and more stuff that I already know I won't need anymore. So the first step was to make some calculations. Except for the rent (that at the moment I can't change and it's unfortunately very high here in Dublin), how much I need for living? I roughly decided that I'm not going to spend more than 20 euro per day, including food, activities and sports and any other need. If I need to spend more one day, that difference has to come from the day before or the day after.&nbsp;</p><p>Probably 20€ is a lot of money for a single day, but Dublin can be quite expensive. So when I don't spend all the 20€ I add the difference to use it the next day. I save more.</p><p>That small saving is already changing my lifestyle. A few days ago I was in a shop (why the hell I was there!!) and I found hanging there the most beautiful hoodie I've ever wanted. Simply perfect, the size, the colour, the material, the shape of the hood, the price.... I just fell in love with it and I told my self it could be useful in my trip. So I was waiting my turn at the counter when I honestly asked my self \"Do I really need that?\". I knew the answer before going. So I turned, put the hoodie back and walk out of that shop.&nbsp;</p><p>\"Do I really need that?\" is the question that is changing my lifestyle, my way of seeing the things that surround my daily life. Maybe I should have asked my self this question even before my decision. Maybe if anybody would think a little bit about this question and be honest with the answer, maybe, we would be less slave of the material things and we would have more space and focus on the \"real things\".</p><p>Next step will be saving on the rent in one of the most expensive cities in Europe.</p>",
      "creationDate" : 1501585903125,
      "id" : "-KqSaZojQdPNkizJ8m5F",
      "isPublic" : false,
      "location" : "Dublin, Ireland",
      "modifyDate" : 1501600597542,
      "title" : "Preparing my self and my budgets"
    },
    "-KqbsABU7gAkyFdzZnbd" : {
      "body" : "<p>So this is the very first version of the plan for this trip around the world, or at least a good part of it.</p><p>v.1.0.0:</p><ul><li>leave from Europe (Sicily, Dublin, ?)</li><li>fly to India, go around this country</li><li>pass through, Nepal then China? Or not?</li><li>go in Thailand, explore every single bit of land there</li><li>Cambogia</li><li>Malesia</li><li>Indonesia</li><li>Australia</li><li>New Zeeland [optional]</li><li>fly in Peru'</li><li>go in Mexico</li><li>finish in a potential I-could-live-here destination</li></ul><p><br></p><p>This plan was originally thought the 22th of July. I already know is going to change soon, and maybe completely except that I want to start with Asia.</p><p><br></p>",
      "creationDate" : 1501760096332,
      "id" : "-KqbsABU7gAkyFdzZnbd",
      "isPublic" : false,
      "location" : "",
      "modifyDate" : 1501760908248,
      "title" : "The plan v.1.0.0"
    }
  },
  "quotes" : [ {
    "author" : "A. A. Milne",
    "quote" : "Always remember you are braver than you believe, stronger than you seem, and smarter than you think"
  }, {
    "quote" : "Life isn't about waiting for the storm to pass. It's about learning to dance in the rain."
  }, {
    "author" : "William James",
    "quote" : "If you can change your mind, you can change your life."
  }, {
    "author" : "Peter Drucker",
    "quote" : "The best way to predict the future is to create it."
  }, {
    "author" : "Norman Vincent Peale",
    "quote" : "Change your thoughts and you change your world."
  }, {
    "author" : "Nelson Mandela",
    "quote" : "It always seems impossible until it's done."
  }, {
    "author" : "Walt Disney",
    "quote" : "If you can dream it, you can do it."
  }, {
    "author" : "Robert Schuller",
    "quote" : "If you listen to your fears, you will die never knowing what a great person you might have been."
  }, {
    "quote" : "On your journey through life, make sure your biography has at least one extraordinary chapter."
  } ],
  "readings" : {
    "have_read" : [ {
      "author" : "Bill Bryson",
      "mostLoved" : true,
      "title" : "A Short History of Nearly Everything"
    }, {
      "author" : "Wayne W. Dyer",
      "mostLoved" : true,
      "title" : "Your Erroneous Zones"
    }, {
      "author" : "Bill Bryson",
      "title" : "Neither Here Nor There"
    }, {
      "author" : "Robyn Davidson",
      "title" : "Tracks"
    }, {
      "author" : "Cheryl Strayed",
      "title" : "Wild: From Lost to Found on the Pacific Crest Trail"
    }, {
      "author" : "Bill Bryson",
      "title" : "A Walk in the Woods"
    }, {
      "author" : "Wilma Johnson",
      "title" : "Surf Mama"
    }, {
      "author" : "Paulo Coelho",
      "mostLoved" : true,
      "title" : "The Alchemist"
    }, {
      "author" : "Paulo Coelho",
      "title" : "The Pilgrimage"
    }, {
      "author" : "Paulo Coelho",
      "title" : "Eleven Minutes"
    }, {
      "author" : "Hal Belson",
      "mostLoved" : true,
      "title" : "Il meraviglioso Viaggio del Viaggiatore Turchino"
    }, {
      "author" : "Rachel Joyce",
      "title" : "The Unlikely Pilgrimage of Harold Fry"
    }, {
      "author" : "Suzanne Collins",
      "title" : "The Hunger Games trylogy"
    } ],
    "on_the_shelf" : [ {
      "author" : "Wayne W. Dyer",
      "title" : "Living the Wisdom of the Tao"
    }, {
      "author" : "Richard Dawkins",
      "title" : "The Selfish Gene"
    }, {
      "author" : "Kary Mullis",
      "title" : "Dancing Naked in the Mind Field"
    }, {
      "author" : "Jon Krakauer",
      "title" : "Into The Wild"
    } ],
    "reading_now" : [ {
      "author" : "Clarissa Pinkola Estés",
      "title" : "Women who run with the wolves"
    }, {
      "author" : "T. K. V. Desikachar",
      "title" : "Heart of Yoga: Developing a Personal Practice"
    }, {
      "author" : "Rolf Potts",
      "title" : "Vagabonding: An Uncommon Guide to the Art of Long-Term World Travel"
    } ]
  }
}
